Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Note: There are two codes for the delete key. 127 is the decimal ASCII value for the delete key, which is always recognized. Some delete keys send another value, in which case this value is obtained from the termcap entry "kD". Both values have the same effect. Also see |:fixdel|.
es_es: Nota: Hay dos códigos para la tecla suprimir. El valor decimal ASCII de la tecla suprime es 127, éste siempre se reconocerá. Algunas teclas suprimir envían otro valor, en cuyo caso el valor se obtiene de la entrada de termcap «kD». Ambos valores tienen el mismo efecto. Véase también |:fixdel|.

source: Note: The keypad keys are used in the same way as the corresponding "normal" keys. For example, <kHome> has the same effect as <Home>. If a keypad key sends the same raw key code as its non-keypad equivalent, it will be recognized as the non-keypad code. For example, when <kHome> sends the same code as <Home>, when pressing <kHome> Vim will think <Home> was pressed. Mapping <kHome> will not work then.
es_es: Nota: El uso de las teclas del teclado numérico es idéntico a sus teclas «normales» correspondientes. Por ejemplo, <kHome> tiene el mismo efecto que <Home>. Si una tecla del bloque envía el mismo código que su equivalente externo al bloque numérico, será reconocido como un código que no pertenece al bloque. Por ejemplo, cuando <kHome> envía el mismo código que <Home>, Vim creerá que pulsa <Home> cuando en realidad pulsa <kHome>. De ser así, las macros con <kHome> no funcionarán.

source: Examples for mapping CTRL-H to the six characters "<Home>": > :imap <C-H> \<Home> :imap <C-H> <lt>Home> The first one only works when the 'B' flag is not in 'cpoptions'. The second one always works. To get a literal "<lt>" in a mapping: > :map <C-L> <lt>lt>
es_es: Ejemplos para asignar CTRL-H a los seis caracteres «<Home>»: > :imap <C-H> \<Home> :imap <C-H> <lt>Home> El primero sólo funciona si la opción 'B' no está en 'cpoptions'. El segundo siempre funciona. Para obtener un <lt> en una macro: > :map <C-L> <lt>lt>

source: For mapping, abbreviation and menu commands you can then copy-paste the examples and use them directly. Or type them literally, including the '<' and '>' characters. This does NOT work for other commands, like ":set" and ":autocmd"!
es_es: Puede copiar y pegar los ejemplos directamente para las macros, abreviaturas y órdenes de menú. O también introducirlos literalmente, incluyendo los caracteres «<» y «>». ¡Esto NO funciona con otras órdenes, como «:set» y «:autocmd».!

source: 5. Modes, introduction *vim-modes-intro* *vim-modes*
es_es: 5. Introducción a los modos *modos-vim* *vim-modes-intro* *vim-modes*

source: Visual mode This is like Normal mode, but the movement commands extend a highlighted area. When a non-movement command is used, it is executed for the highlighted area. See |Visual-mode|. If the 'showmode' option is on "-- VISUAL --" is shown at the bottom of the window.
es_es: Modo Visual Es similar al modo Normal, pero las órdenes de movimiento extienden un área resaltada. Cuando use una orden que no sea de moción, éste afectará a toda el área resaltada. Consulte |Visual-mode|. Si la opción 'showmode' está activada, verá «-- VISUAL --» en la parte inferior de la ventana.

source: Select mode This looks most like the MS-Windows selection mode. Typing a printable character deletes the selection and starts Insert mode. See |Select-mode|. If the 'showmode' option is on "-- SELECT --" is shown at the bottom of the window.
es_es: Modo seleccionar Similar al modo de selección de MS-Windows. Teclear un carácter imprimible elimina la selección e inicia el modo Insertar. Consulte |Select-mode|. Si la opción 'showmode' esta activada, verá «-- SELECT --» en la parte inferior de la ventana.

source: Insert mode In Insert mode the text you type is inserted into the buffer. See |Insert-mode|. If the 'showmode' option is on "-- INSERT --" is shown at the bottom of the window.
es_es: Modo Insertar En el modo Insertar, el texto que teclee aparecerá en el búfer. Consulte |Insert-mode|. Si la opción 'showmode' esta activada, verá «-- INSERT --» en la parte inferior de la ventana.

source: Command-line mode In Command-line mode (also called Cmdline mode) you Cmdline mode can enter one line of text at the bottom of the window. This is for the Ex commands, ":", the pattern search commands, "?" and "/", and the filter command, "!". |Cmdline-mode|
es_es: Modo Línea de órdenes En este modo (también llamado «Cmdline mode») Cmdline mode puede introducir una línea de texto en la parte inferior de la ventana. Ésto es para las órdenes Ex, «:», las órdenes de búsqueda de patrón, «?» y «/», y la orden de filtrado, «!». |Cmdline-mode|

source: Ex mode Like Command-line mode, but after entering a command you remain in Ex mode. Very limited editing of the command line. |Ex-mode|
es_es: Modo Ex Es similar al modo Línea de órdenes, pero permanecerá en modo Ex después de ejecutar la orden. Ofrece una edición limitada de la línea de órdenes. |Ex-mode|

source: *Operator-pending* *Operator-pending-mode* Operator-pending mode This is like Normal mode, but after an operator command has started, and Vim is waiting for a {motion} to specify the text that the operator will work on.
es_es: *Operator-pending* *Operator-pending-mode* Modo Operator-pending Es similar al modo Normal, pero se inicia tras una orden de operador, tras el cual Vim esperará a un movimiento {motion} para especificar el texto afectado por el operador.

source: Replace mode Replace mode is a special case of Insert mode. You can do the same things as in Insert mode, but for each character you enter, one character of the existing text is deleted. See |Replace-mode|. If the 'showmode' option is on "-- REPLACE --" is shown at the bottom of the window.
es_es: Modo Reemplazar El modo Reemplazar es un tipo especial del modo Insertar. Puede hacer las mismas cosas que en el modo Insertar, pero sustituirá un carácter existente por cada carácter que inserte. Consulte |Replace-mode|. Si la opción 'showmode' está activada, verá «-- REPLACE --» en la base de la ventana.

source: Virtual Replace mode Virtual Replace mode is similar to Replace mode, but instead of file characters you are replacing screen real estate. See |Virtual-Replace-mode|. If the 'showmode' option is on "-- VREPLACE --" is shown at the bottom of the window.
es_es: Modo Reemplazar Virtual El modo Reemplazar Virtual es similar al modo Reemplazar, pero en lugar de reemplazar caracteres, reemplaza el estado real de la pantalla. Consulte |Virtual-Replace-mode|. Si la opción 'showmode' está activada, verá «-- VREPLACE --» en la base de la ventana.

source: Insert Select mode Entered when starting Select mode from Insert mode. E.g., by dragging the mouse or <S-Right>. When the Select mode ends, Vim returns to Insert mode. If the 'showmode' option is on "-- (insert) SELECT --" is shown at the bottom of the window.
es_es: Modo Seleccionar Se inicia al ejecutar el modo Seleccionar a partir de inserción del modo Insertar. Por ejemplo, arrastrando el ratón o <S-Derecha>. Vim le devolverá al modo Insertar al finalizar el modo Seleccionar. Si la opción 'showmode' está activada, verá «-- (insert) SELECT --» en la base de la ventana.

source: 6. Switching from mode to mode *mode-switching*
es_es: 6. Cambiar de modo *cambiar-modo* *mode-switching*

source: *i_esc* TO mode ~ Normal Visual Select Insert Replace Cmd-line Ex ~ FROM mode ~ Normal v V ^V *4 *1 R gR : / ? ! Q Visual *2 ^G c C -- : -- Select *5 ^O ^G *6 -- -- -- Insert <Esc> -- -- <Insert> -- -- Replace <Esc> -- -- <Insert> -- -- Command-line *3 -- -- :start -- -- Ex :vi -- -- -- -- --
es_es: *i_esc* DESDE el modo ~ Normal Visual Selección Insertar Reemplazar Línea Ex ~ de órdenes A el modo ~ Normal v V ^V *4 *1¿ R gR : / ? ! Q Visual *2 ^G c C -- : -- Seleccionar *5 ^O ^G *6 -- -- -- Insertar <Esc> -- -- <Insertar> -- -- Reemplazar <Esc> -- -- <Insertar> -- -- Línea de órdenes *3 -- -- :start -- -- Ex :vi -- -- -- -- --

source: *CTRL-\_CTRL-N* *i_CTRL-\_CTRL-N* *c_CTRL-\_CTRL-N* *v_CTRL-\_CTRL-N* Additionally the command CTRL-\ CTRL-N or <C-\><C-N> can be used to go to Normal mode from any other mode. This can be used to make sure Vim is in Normal mode, without causing a beep like <Esc> would. However, this does not work in Ex mode. When used after a command that takes an argument, such as |f| or |m|, the timeout set with 'ttimeoutlen' applies.
es_es: *CTRL-\_CTRL-N* *i_CTRL-\_CTRL-N* *c_CTRL-\_CTRL-N* *v_CTRL-\_CTRL-N* De forma adicional, puede usar CTRL-\ CTRL-N o <C-\><C-N> para pasar al modo Normal a partir de cualquier otro. Puede usar esto para asegurarse de que Vim está en modo Normal, sin causar el pitido que <Esc> realiza. Por otra parte, esto no funciona en modo Ex. Si usa esto después de una orden que toma un argumento, como |f| o |m|, se aplicará la cuenta atrás definida con 'ttimeoutlen'.

source: *CTRL-\_CTRL-G* *i_CTRL-\_CTRL-G* *c_CTRL-\_CTRL-G* *v_CTRL-\_CTRL-G* The command CTRL-\ CTRL-G or <C-\><C-G> can be used to go to Insert mode when 'insertmode' is set. Otherwise it goes to Normal mode. This can be used to make sure Vim is in the mode indicated by 'insertmode', without knowing in what mode Vim currently is.
es_es: *CTRL-\_CTRL-G* *i_CTRL-\_CTRL-G* *c_CTRL-\_CTRL-G* *v_CTRL-\_CTRL-G* La orden CTRL-\ CTRL-G o <C-\><C-G> se puede usar para pasar al modo Insertar cuando 'insertmode' está definido. En caso contrario, vuelve al modo Normal. Puede usar esto para asegurarse de que Vim está en el modo indicado por 'insertmode', sin conocer el modo actual en el que está Vim.

source: 7. The window contents *window-contents*
es_es: 7. El contenido de las ventanas *ventanas-contenido* *window-contents*

source: In Normal mode and Insert/Replace mode the screen window will show the current contents of the buffer: What You See Is What You Get. There are two exceptions: - When the 'cpoptions' option contains '$', and the change is within one line, the text is not directly deleted, but a '$' is put at the last deleted character. - When inserting text in one window, other windows on the same text are not updated until the insert is finished. {Vi: The screen is not always updated on slow terminals}
es_es: La ventana muestra los contenidos actuales del búfer en modo Normal y modo Insertar/Reemplazar: lo que ve es lo que hay. Hay dos excepciones: - Si la opción 'cppoptions' contiene «$», y el cambio se realizará dentro de una línea, el texto no se eliminará directamente, sino que se insertará «$» en el último carácter eliminado. - Si inserta texto en una ventana, otras ventanas mostrando el mismo contenido no se actualizarán hasta finalizar la inserción. {Vi: La pantalla no se refrescará siempre en terminales lentas}

source: Lines longer than the window width will wrap, unless the 'wrap' option is off (see below). The 'linebreak' option can be set to wrap at a blank character.
es_es: Las líneas más largas que el ancho de la ventana se justificarán a menos que la opción 'wrap' esté desactivada (consulte a continuación). La opción 'linebreak' se puede configurar para justificar a partir de un carácter vacío.

source: +-----------------------+ |some line | |last line | |~ | |~ | +-----------------------+
es_es: +-----------------------+ |alguna línea | |última línea | |~ | |~ | +-----------------------+

source: +-----------------------+ |first line | |second line | |@ | |@ | +-----------------------+
es_es: +-----------------------+ |primera línea | |segunda línea | |@ | |@ | +-----------------------+

source: +-----------------------+ |first line | |second line | |a very long line that d| |oesn't fit in the wi@@@| +-----------------------+
es_es: +-----------------------+ |primera línea | |segunda línea | |una línea muy larga que| |no encaja en la vent@@@| +-----------------------+

source: If there is a single line that is too long to fit in the window, this is a special situation. Vim will show only part of the line, around where the cursor is. There are no special characters shown, so that you can edit all parts of this line. {Vi: gives an "internal error" on lines that do not fit in the window}
es_es: Una situación particular es cuando existe una sola línea que no encaja en la ventana. Vim mostrará solo la parte de la línea en torno al cursor. No verá caracteres especiales, para que así pueda editar esa parte de la línea. {Vi: devuelve un «error interno» en las líneas que no encajan en la ventana.}

source: The '@' occasion in the 'highlight' option can be used to set special highlighting for the '@' and '~' characters. This makes it possible to distinguish them from real characters in the buffer.
es_es: La aparición de «@» en la opción 'highlight' (resaltar) se puede usar para dar un resaltado especial a los caracteres «@» y «~». Esto posibilita distinguirlos de aquellos caracteres reales en el búfer.

source: All normal ASCII characters are displayed directly on the screen. The <Tab> is replaced with the number of spaces that it represents. Other non-printing characters are replaced with "^{char}", where {char} is the non-printing character with 64 added. Thus character 7 (bell) will be shown as "^G". Characters between 127 and 160 are replaced with "~{char}", where {char} is the character with 64 subtracted. These characters occupy more than one position on the screen. The cursor can only be positioned on the first one.
es_es: Todos los caracteres normales ASCII aparecerán directamente en la pantalla. La tecla <Tab> será reemplazada por el número de espacios que representa. Otros caracteres no imprimibles se reemplazarán por «^{char}», donde {char} es el carácter no imprimible más la suma de 64. Por ello, el carácter 7 (campana) aparecerá como «^G». Los caracteres entre el 127 y el 160 serán reemplazados por «~{char}», donde {char} es el carácter menos la resta de 64. Estos caracteres tomarán más de un espacio en la pantalla. El cursor sólo aparecerá sobre el primero.

source: If you set the 'number' option, all lines will be preceded with their number. Tip: If you don't like wrapping lines to mix with the line numbers, set the 'showbreak' option to eight spaces: ":set showbreak=\ \ \ \ \ \ \ \ "
es_es: Si activa la opción 'number', todas las líneas estarán precedidas por su número. Consejo: Si no le gusta que el justificado de línea se mezcle con los números de línea, configure la opción 'showbreak' con 8 espacios: «:set showbreak=\ \ \ \ \ \ \ \ »

source: If you set the 'list' option, <Tab> characters will not be shown as several spaces, but as "^I". A '$' will be placed at the end of the line, so you can find trailing blanks.
es_es: Los caracteres <Tab> aparecerán como ^I, en lugar de como varios espacios, en caso de activar la opción 'list'. Se insertará un «$» al final de la línea para así poder encontrar caracteres en exceso al final de la línea.

source: In Command-line mode only the command-line itself is shown correctly. The display of the buffer contents is updated as soon as you go back to Command mode.
es_es: En el modo Línea de órdenes, sólo la misma línea de órdenes se mostrará correctamente. La vista de los contenidos del búfer se actualizarán tan pronto como vuelva al modo de órdenes.

source: The last line of the window is used for status and other messages. The status messages will only be used if an option is on:
es_es: La última línea de la ventana se usa para mostrar el estado y otros mensajes. Sólo se mostrarán los mensajes de estado si activa una opción:

source: The current mode is "-- INSERT --" or "-- REPLACE --", see |'showmode'|. The command characters are those that you typed but were not used yet. {Vi: does not show the characters you typed or the cursor position}
es_es: El modo actual es «-- INSERT --» o «-- REPLACE --», consulte |'showmode|. Los caracteres de la orden son aquellos que tecleó pero que aún no ha ejectuado. {Vi: no muestra los caracteres que ha introducido, o la posición del cursor.}

source: If you have a slow terminal you can switch off the status messages to speed up editing: :set nosc noru nosm
es_es: Puede desactivar los mensajes de estado para agilizar la edición si tiene una terminal lenta: :set nosc noru nosm

source: If there is an error, an error message will be shown for at least one second (in reverse video). {Vi: error messages may be overwritten with other messages before you have a chance to read them}
es_es: En caso de error, verá un mensaje de error durante al menos un segundo (en vídeo inverso). {Vi: puede que los mensajes de error sean sobreescritos antes de poder leerlos.}

source: Some commands show how many lines were affected. Above which threshold this happens can be controlled with the 'report' option (default 2).
es_es: Algunas órdenes muestran cuantas líneas fueron afectadas. Puede controlar el umbral a partir del cual esto ocurre con la opción 'report' (2 por omisión).

source: On the Amiga Vim will run in a CLI window. The name Vim and the full name of the current file name will be shown in the title bar. When the window is resized, Vim will automatically redraw the window. You may make the window as small as you like, but if it gets too small not a single line will fit in it. Make it at least 40 characters wide to be able to read most messages on the last line.
es_es: Vim se ejecutará en una ventana CLI bajo Amiga. El nombre «Vim» y el nombre completo del archivo aparecerán en la barra de título. Vim redibujará la ventana en caso de redimensionarla. Puede reducir la ventana tanto como quiera, pero no cabrá ni una línea en caso de reducirla demasiado. Haga que tenga, por lo menos, un ancho de 40 columnas para poder leer la mayoría de mensajes en la última línea.

source: On most Unix systems, resizing the window is recognized and handled correctly by Vim. {Vi: not ok}
es_es: En la mayoría de sistemas Unix Vim trata adecuadamente redimensionar las ventanas. {Vi: no tan bien.}

source: 8. Definitions *definitions*
es_es: 8. Definiciones *definiciones* *definitions*

source: screen The whole area that Vim uses to work in. This can be a terminal emulator window. Also called "the Vim window". window A view on a buffer.
es_es: pantalla El área completa que usa Vim. Puede ser la ventana de un emulador de terminal. También llamada la «ventana de Vim». ventana El área de visión de un búfer.

source: +-------------------------------+ screen | window 1 | window 2 | | | | | | | |= status line =|= status line =| | window 3 | | | | | |==== status line ==============| |command line | +-------------------------------+
es_es: +-------------------------------+ pantalla| ventana 1 | ventana 2 | | | | | | | |línea de estado|línea de estado| | ventana 3 | | | | | |==== línea de estado ==========| |línea de órdenes | +-------------------------------+

source: The command line is also used for messages. It scrolls up the screen when there is not enough room in the command line.
es_es: La línea de órdenes se usa también para mensajes. Desplaza la pantalla hacia arriba cuando no hay suficiente espacio para la línea de órdenes.

source: buffer lines logical lines window lines screen lines ~
es_es: líneas de búfer líneas lógicas líneas de ventana líneas de pantalla ~

source: 1. one 1. one 1. +-- folded 1. +-- folded 2. two 2. +-- folded 2. five 2. five 3. three 3. five 3. six 3. six 4. four 4. six 4. seven 4. seven 5. five 5. seven 5. === status line === 6. six 6. aaa 7. seven 7. bbb 8. ccc ccc c 1. aaa 1. aaa 1. aaa 9. cc 2. bbb 2. bbb 2. bbb 10. ddd 3. ccc ccc ccc 3. ccc ccc ccc 3. ccc ccc c 11. ~ 4. ddd 4. ddd 4. cc 12. === status line === 5. ddd 13. (command line) 6. ~
es_es: 1. uno 1. uno 1. +-- plegado 1. +-- plegado 2. dos 2. +-- plegado 2. cinco 2. cinco 3. tres 3. cinco 3. seis 3. seis 4. cuatro 4. seis 4. siete 4. siete 5. cinco 5. siete 5. === línea de estado === 6. seis 6. aaa 7. siete 7. bbb 8. ccc ccc c 1. aaa 1. aaa 1. aaa 9. cc 2. bbb 2. bbb 2. bbb 10. ddd 3. ccc ccc ccc 3. ccc ccc ccc 3. ccc ccc c 11. ~ 4. ddd 4. ddd 4. cc 12. === línea de estado === 5. ddd 13. (línea de órdenes) 6. ~

source: *usr_21.txt* For Vim version 7.3. Last change: 2008 Nov 09
es_es: *usr_21.esx* Para Vim version 7.3. Último cambio: 9/11/2008

source: Go away and come back
es_es: Abandonar el editor y volver

source: |21.1| Suspend and resume |21.2| Executing shell commands |21.3| Remembering information; viminfo |21.4| Sessions |21.5| Views |21.6| Modelines
es_es: |21.1| Suspender y continuar |21.2| Ejecutar órdenes de consola |21.3| Recordar información; viminfo |21.4| Sesiones |21.5| Vistas |21.6| «Modelines»

source: Next chapter: |usr_22.txt| Finding the file to edit Previous chapter: |usr_20.txt| Typing command-line commands quickly Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_22.esx| Encontrar el archivo a editar Capítulo anterior: |usr_20.esx| Teclear con rapidez órdenes de consola Tabla de contenidos: |usr_toc.esx|

source: *21.1* Suspend and resume
es_es: *21.1* Suspender y continuar

source: CTRL-Z {any sequence of shell commands} fg
es_es: CTRL-Z {cualquier secuencia de órdenes de consola} fg

source: Only Unix has support for this. On other systems Vim will start a shell for you. This also has the functionality of being able to execute shell commands. But it's a new shell, not the one that you started Vim from. When you are running the GUI you can't go back to the shell where Vim was started. CTRL-Z will minimize the Vim window instead.
es_es: Solo Unix es compatible con esta función. Vim iniciará una consola en otros sistemas. Esto también tiene la funcionalidad de permitirle ejecutar órdenes de consola. Pero esta es una nueva consola, no desde la que inició Vim. Cuando está ejecutando la interfaz gráfica no puede volver a la consola desde la que se inició Vim. En esta situación, CTRL-Z minimizará la ventana de Vim.

source: *21.2* Executing shell commands
es_es: *21.2* Ejecutar órdenes de consola

source: To execute a single shell command from Vim use ":!{command}". For example, to see a directory listing: >
es_es: Use «:!{orden}» para ejecutar una sola orden de consola desde Vim. Por ejemplo, para ver el listado de un directorio: >

source: The first one is for Unix, the second one for MS-Windows. Vim will execute the program. When it ends you will get a prompt to hit <Enter>. This allows you to have a look at the output from the command before returning to the text you were editing. The "!" is also used in other places where a program is run. Let's take a look at an overview:
es_es: El primero es para Unix, el segundo para MS-Windows. Vim ejecutará el programa. Cuando finalice, obtendrá un dialogo para pulsar <Intro>. Esto le permite ver la salida de la orden antes de volver al texto que estaba editando. El signo «!» también se usa en otros sitios cuando se ejecuta un programa. Veamos com funciona esto de una manera general.

source: :!{program} execute {program} :r !{program} execute {program} and read its output :w !{program} execute {program} and send text to its input :[range]!{program} filter text through {program}
es_es: :!{programa} execute {programa} :r !{programa} execute {programa} y lea su salida :w !{programa} execute {programa} y envíe texto a su entrada :[range]!{programa} filtra texto a través de {programa}

source: Notice that the presence of a range before "!{program}" makes a big difference. Without it executes the program normally, with the range a number of text lines is filtered through the program.
es_es: Nótese que la presencia de un rango antes de «!{programa}» marca una gran diferencia. Sin él, ejecuta el programa de manera normal, con el rango se filtran un número de líneas a través del programa.
